system/fvSolutionOld
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     4.1;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr      3;
        nAlphaSubCycles 2;
        cAlpha          1;
        icAlpha		0;

        alphaOuterCorrectors  yes;

        MULESCorr       yes;
        nLimiterIter    20;
        alphaApplyPrevCorr  true;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;  
        relTol          0; 
        minIter         1; 


    }

    "pcorr.*"
    {
        solver          GAMG;
        tolerance       5e-10;
        smoother        GaussSeidel;
    }

    p_rgh
    {
        solver          GAMG;
        tolerance       5e-8;
        relTol          0;
        smoother        DIC;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;	

    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0;
        nSweeps         1;
    }

    "(U|k|epsilon)Final"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0;
        nSweeps         1;
    }
}

PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    3;
    nCorrectors         2;
    nNonOrthogonalCorrectors 1;
    correctPhi          yes;
    moveMeshOuterCorrectors yes;
    turbOnFinalIterOnly yes; 
}

relaxationFactors
{
    fields
    {
//	p_rgh 		0.3;
//	U		0.3;
//	p_rghFinal	0.3;
//	k 		0.7;
//	omega 		0.7;
    }
    equations
    {        
        ".*" 1;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
