system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     4.1;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat raw;
surfaceFormat vtk;

formatOptions
{
    ensight
    {
        format  ascii;
    }
}

interpolationScheme cellPoint;

fields
(
    p
    U
    alpha.water
    p_rgh
);

sets
(

);


surfaces
(
    floatingObject
    {
        type            patch;
        patches         ( ".*floatingObject.*" );
    }
    freeSurface
    {
        type            isoSurface;    // always triangulated
        isoField        alpha.water;
        isoValue        0.5;
        interpolate     true;
    }
);


// *********************************************************************** //
