system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     4.1;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box ( -500 -500 -500 ) ( 500 500 0 );
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }

    // boxToCell
    // {
    //     box ( -100 -100 -100 ) ( -0.35 100 0.65 );
    //     fieldValues ( volScalarFieldValue alpha.water 1 );
    // }
);


// ************************************************************************* //
